[{"pdf": "5.2 Application layer (1).pdf", "chunk_index": 0, "text": "Module_5\nApplication Layer: Standard Client-Server Protocols:World Wide Web,\nHTTP, FTP, Electronic Mail, Domain Name System (DNS), SNMP.\n1.What is Domain Name System(DNS)\nA Domain Name System (DNS) is a critical component of the Internet\ninfrastructure that plays a fundamental role in connecting users to websites,\nservices, and resources across the World Wide Web. It is essentially the “phone\nbook” of the internet, translating user-friendly domain names (like\nwww.example.com) into numerical IP addresses (such as 192.0.2.1) that computers\nand network devices use to locate one another on the internet.\nExplanation of the entire process presented in the above diagram\n1. From user computer do a DNS query to ISP’s recursive DNS server:\nWhen a user enters a domain name (e.g., www.example.com) into a web browser,\ntheir computer sends a DNS query to their Internet Service Provider’s (ISP)\nrecursive DNS server. The recursive DNS server is responsible for handling DNS"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 1, "text": "recursive DNS server. The recursive DNS server is responsible for handling DNS\nqueries on behalf of the user and tries to resolve the domain name.\n2. Do a DNS query to Root DNS server:\nIf the recursive DNS server doesn’t have the IP address for the requested domain\nin its cache, it starts the resolution process by querying the root DNS server.The\nroot DNS server is the top-level server in the DNS hierarchy, and it contains\ninformation about the authoritative DNS servers for top-level domains (TLDs),\nsuch as “.com,” “.org,” “.net,” etc.\n3. Ask .com server to ISP’s recursive DNS server:\nThe root DNS server responds to the recursive DNS server’s query with a referral\nto the authoritative DNS server for the “.com” TLD.The recursive DNS server then\nqueries the “.com” TLD DNS server for the IP address of the domain in question.\n4. DNS query to Top Level domain DNS server “.com”:\nThe “.com” TLD DNS server, in response to the query from the recursive DNS"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 2, "text": "4. DNS query to Top Level domain DNS server “.com”:\nThe “.com” TLD DNS server, in response to the query from the recursive DNS\nserver, provides a referral to the authoritative DNS server responsible for the\nspecific domain, in this case, “example.com.”\n5. Ask DYN server to ISP’s recursive DNS server:\nThe recursive DNS server queries the authoritative DNS server for\n“example.com.” The authoritative DNS server for “example.com” is often a\nDynamic DNS (DYN) server that contains the specific DNS records for the\ndomain, such as A records (for IP addresses), MX records (for mail servers), etc.\n6. DNS query to Authoritative DYN DNS Server:\nThe authoritative DYN DNS server receives the query and looks up the requested\nDNS record, such as the A record for “www.example.com.”\n7. Authoritative response to ISP’s recursive DNS server:\nThe authoritative DYN DNS server responds to the recursive DNS server with the\nrequested DNS record, which includes the IP address associated with\n“www.example.com.”"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 3, "text": "requested DNS record, which includes the IP address associated with\n“www.example.com.”\n8. Response to user computer:\nFinally, the recursive DNS server sends the IP address it received from the\nauthoritative DYN DNS server back to the user’s computer. The user’s computer\ncan then use this IP address to establish a connection to the web server hosting\n“www.example.com.”\nClient-Server Model\nThe Client-server model is a distributed application structure that partitions tasks\nor workloads between the providers of a resource or service, called servers, and\nservice requesters called clients. In the client-server architecture, when the client\ncomputer sends a request for data to the server through the internet, the server\naccepts the requested process and delivers the data packets requested back to the\nclient. Clients do not share any of their resources. Examples of the Client-Server\nModel are Email, World Wide Web, etc.\nHow Does the Client-Server Model Work?"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 4, "text": "Model are Email, World Wide Web, etc.\nHow Does the Client-Server Model Work?\nIn this article, we are going to take a dive into the Client-Server model and have a\nlook at how the Internet works via, web browsers. This article will help us have a\nsolid WEB foundation and help us easily work with WEB technologies.\n● Client: When we say the word Client, it means to talk of a person or an\norganization using a particular service. Similarly in the digital world, a\nClient is a computer (Host) i.e. capable of receiving information or using\na particular service from the service providers (Servers).\n● Servers: Similarly, when we talk about the word Servers, It means a\nperson or medium that serves something. Similarly in this digital world, a\nServer is a remote computer that provides information (data) or access to\nparticular services.\nSo, it is the Client requesting something and the Server serving it as long as it is in\nthe database.\nHow the Browser Interacts With the Servers?"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 5, "text": "So, it is the Client requesting something and the Server serving it as long as it is in\nthe database.\nHow the Browser Interacts With the Servers?\nThere are a few steps to follow to interacts with the servers of a client.\n● User enters the URL(Uniform Resource Locator) of the website or file.\nThe Browser then requests the DNS(DOMAIN NAME SYSTEM)\nServer.\n● DNS Server lookup for the address of the WEB Server.\n● The DNS Server responds with the IP address of the WEB Server.\n● The Browser sends over an HTTP/HTTPS request to the WEB Server’s\nIP (provided by the DNS server).\n● The Server sends over the necessary files for the website.\n● The Browser then renders the files and the website is displayed. This\nrendering is done with the help of DOM (Document Object Model)\ninterpreter, CSS interpreter, and JS Engine collectively known as the\nJIT or (Just in Time) Compilers.\nClient Server Request and Response\nAdvantages of Client-Server Model\n● Centralized system with all data in a single place."}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 6, "text": "Client Server Request and Response\nAdvantages of Client-Server Model\n● Centralized system with all data in a single place.\n● Cost efficient requires less maintenance cost and Data recovery is\npossible.\n● The capacity of the Client and Servers can be changed separately.\nDisadvantages of Client-Server Model\n● Clients are prone to viruses, Trojans, and worms if present in the Server\nor uploaded into the Server.\n● Servers are prone to Denial of Service (DOS) attacks.\n● Data packets may be spoofed or modified during transmission.\n● Phishing or capturing login credentials or other useful information of the\nuser are common and MITM(Man in the Middle) attacks are common.\nThe client-server architecture consolidates resources on servers for greater control\nand security, allows for flexible client options, and relies on a robust network for\nscalability and efficiency. While there are cost implications, the client-server\nmodel remains fundamental and has been shaped by trends such as cloud"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 7, "text": "model remains fundamental and has been shaped by trends such as cloud\ncomputing.\nWorld Wide Web (WWW)\nWWW stands for World Wide Web and is commonly known as the Web.\nWWW is defined as the collection of different websites around the world,\ncontaining different information shared via local servers(or computers).\nWeb pages are linked together using hyperlinks which are HTML-formatted and,\nalso referred to as hypertext, these are the fundamental units of the Internet and are\naccessed through Hypertext Transfer Protocol(HTTP). Such digital connections, or\nlinks, allow users to easily access desired information by connecting relevant\npieces of information. The benefit of hypertext is it allows you to pick a word or\nphrase from the text and click on other sites that have more information about it.\nThis data may be presented in text, picture, audio, or video formats on the internet.\nSystem Architecture\nFrom the user’s point of view, the web consists of a vast, worldwide connection of"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 8, "text": "System Architecture\nFrom the user’s point of view, the web consists of a vast, worldwide connection of\ndocuments or web pages. Each page may contain links to other pages anywhere in\nthe world. The pages can be retrieved and viewed by using browsers of which\ninternet explorer, Netscape Navigator, Google Chrome, etc are the popular ones.\nThe browser fetches the page requested interprets the text and formatting\ncommands on it, and displays the page, properly formatted, on the screen.\nThe basic model of how the web works are shown in the figure below. Here the\nbrowser is displaying a web page on the client machine. When the user clicks on a\nline of text that is linked to a page on the abd.com server, the browser follows the\nhyperlink by sending a message to the abd.com server asking it for the page.\nHere the browser displays a web page on the client machine when the user clicks\non a line of text that is linked to a page on abd.com, the browser follows the"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 9, "text": "on a line of text that is linked to a page on abd.com, the browser follows the\nhyperlink by sending a message to the abd.com server asking for the page.\nWorking of WWW\nA Web browser is used to access web pages. Web browsers can be defined as\nprograms which display text, data, pictures, animation and video on the Internet.\nHyperlinked resources on the World Wide Web can be accessed using software\ninterfaces provided by Web browsers. Initially, Web browsers were used only for\nsurfing the Web but now they have become more universal.\nThe below diagram indicates how the Web operates just like client-server\narchitecture of the internet. When users request web pages or other information,\nthen the web browser of your system request to the server for the information and\nthen the web server provide requested services to web browser back and finally\nthe requested service is utilized by the user who made the request.\nWeb browsers can be used for several tasks including conducting searches,"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 10, "text": "the requested service is utilized by the user who made the request.\nWeb browsers can be used for several tasks including conducting searches,\nmailing, transferring files, and much more. Some of the commonly used browsers\nare Internet Explorer, Opera Mini, and Google Chrome.\nFeatures of WWW\n● WWW is open source.\n● It is a distributed system spread across various websites.\n● It is a Hypertext Information System.\n● It is Cross-Platform.\n● Uses Web Browsers to provide a single interface for many services.\n● Dynamic, Interactive and Evolving.\nComponents of the Web\nThere are 3 components of the web:\n● Uniform Resource Locator (URL): URL serves as a system for\nresources on the web.\n● Hyper Text Transfer Protocol (HTTP): HTTP specifies\ncommunication of browser and server.\n● Hyper Text Markup Language (HTML): HTML defines the structure,\norganisation and content of a web page.\nDifference Between WWW and Internet\nWWW Internet\nIt is originated in 1989. It is originated in 1960."}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 11, "text": "organisation and content of a web page.\nDifference Between WWW and Internet\nWWW Internet\nIt is originated in 1989. It is originated in 1960.\nWWW is an interconnected network of websites\nInternet is used to connect a computer\nand documents that can be accessed via the\nwith other computer .\nInternet.\nWWW used protocols such as HTTP Internet used protocols such as TCP/IP\nIt is based on software. It is based on hardware.\nThere is a entire infrastructure in\nIt is a service contained inside an infrastructure.\ninternet.\nWhat is HTTP ?\nHTTP (Hypertext Transfer Protocol) is a fundamental protocol of the Internet,\nenabling the transfer of data between a client and a server. It is the foundation of\ndata communication for the World Wide Web.\nHTTP provides a standard between a web browser and a web server to establish\ncommunication. It is a set of rules for transferring data from one computer to\nanother. Data such as text, images, and other multimedia files are shared on the"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 12, "text": "another. Data such as text, images, and other multimedia files are shared on the\nWorld Wide Web. Whenever a web user opens their web browser, the user\nindirectly uses HTTP. It is an application protocol that is used for distributed,\ncollaborative, hypermedia information systems.\nHTTP Request/Response:\nHTTP is a request-response protocol, which means that for every request sent by a\nclient (typically a web browser), the server responds with a corresponding\nresponse. The basic flow of an HTTP request-response cycle is as follows:\n● Client sends an HTTP request: The client (usually a web browser)\ninitiates the process by sending an HTTP request to the server. This\nrequest includes a request method (GET, POST, PUT, DELETE, etc.),\nthe target URI (Uniform Resource Identifier, e.g., a URL), headers, and\nan optional request body.\n● Server processes the request: The server receives the request and\nprocesses it based on the requested method and resource. This may"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 13, "text": "● Server processes the request: The server receives the request and\nprocesses it based on the requested method and resource. This may\ninvolve retrieving data from a database, executing server-side scripts, or\nperforming other operations.\n● Server sends an HTTP response: After processing the request, the\nserver sends an HTTP response back to the client. The response includes\na status code (e.g., 200 OK, 404 Not Found), response headers, and an\noptional response body containing the requested data or content.\n● Client processes the response: The client receives the server's response\nand processes it accordingly. For example, if the response contains an\nHTML page, the browser will render and display it. If it's an image or\nother media file, the browser will display or handle it appropriately.\nFeatures\n● Stateless: Each request is independent, and the server doesn't retain\nprevious interactions' information.\n● Text-Based: Messages are in plain text, making them readable and\ndebuggable."}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 14, "text": "previous interactions' information.\n● Text-Based: Messages are in plain text, making them readable and\ndebuggable.\n● Client-Server Model: Follows a client-server architecture for requesting\nand serving resources.\n● Request-Response: Operates on a request-response cycle between\nclients and servers.\n● Request Methods: Supports various methods like GET, POST, PUT,\nDELETE for different actions on resources.\nAdvantages\n● Platform independence: Works on any operating system\n● Compatibility: Compatible with various protocols and technologies\n● Efficiency: Optimized for performance\n● Security: Supports encryption for secure data transfer\nFile Transfer Protocol (FTP)\nFile transfer protocol (FTP) is an Internet tool provided by TCP/IP. The first\nfeature of FTP was developed by Abhay Bhushan in 1971. It helps to transfer files\nfrom one computer to another by providing access to directories or folders on\nremote computers and allows software, data, and text files to be transferred"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 15, "text": "remote computers and allows software, data, and text files to be transferred\nbetween different kinds of computers. The end-user in the connection is known as\nlocalhost and the server which provides data is known as the remote host.\nThe goals of FTP are:\n● It encourages the direct use of remote computers.\n● It shields users from system variations (operating system, directory\nstructures, file structures, etc.)\n● It promotes the sharing of files and other types of data.\nWhy FTP?\nFTP is a standard communication protocol. There are various other protocols like\nHTTP which are used to transfer files between computers, but they lack clarity and\nfocus as compared to FTP. Moreover, the systems involved in connection are\nheterogeneous systems, i.e. they differ in operating systems, directories, structures,\ncharacter sets, etc the FTP shields the user from these differences and transfers\ndata efficiently and reliably.\nFTP can transfer ASCII, EBCDIC, or image files. The ASCII is the default file"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 16, "text": "data efficiently and reliably.\nFTP can transfer ASCII, EBCDIC, or image files. The ASCII is the default file\nshare format, in this, each character is encoded by NVT ASCII. In ASCII or\nEBCDIC the destination must be ready to accept files in this mode. The image file\nformat is the default format for transforming binary files.\nFTP Clients\nFTP works on a client-server model. The FTP client is a program that runs on the\nuser’s computer to enable the user to talk to and get files from remote computers. It\nis a set of commands that establishes the connection between two hosts, helps to\ntransfer the files, and then closes the connection.\nSome of the commands are: get the filename(retrieve the file from thedirectories\nget server), mget filename(retrieve multiple files from the server ), ls(lists files\navailable in the current directory of the server). There are also built-in FTP\nprograms, which makes it easier to transfer files and it does not require\nremembering the commands."}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 17, "text": "programs, which makes it easier to transfer files and it does not require\nremembering the commands.\nType of FTP Connections\nFTP connections are of two types:\n1. Active FTP connection: In an Active FTP connection, the client establishes the\ncommand channel and the server establishes the data channel. When the client\nrequests the data over the connection the server initiates the transfer of the data to\nthe client. It is not the default connection because it may cause problems if there is\na firewall in between the client and the server.\n2. Passive FTP connection: In a Passive FTP connection, the client establishes\nboth the data channel as well as the command channel. When the client requests\nthe data over the connection, the server sends a random port number to the client,\nas soon as the client receives this port number it establishes the data channel. It is\nthe default connection, as it works better even if the client is protected by the\nfirewall.\nAnonymous FTP"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 18, "text": "the default connection, as it works better even if the client is protected by the\nfirewall.\nAnonymous FTP\nSome sites can enable anonymous FTP whose files are available for public access.\nSo, the user can access those files without any username or password. Instead, the\nusername is set to anonymous and the password to the guest by default. Here, the\naccess of the user is very limited. For example, the user can copy the files but not\nallowed to navigate through directories.\nFTP\nThe FTP connection is established between two systems and they communicate\nwith each other using a network. So, for the connection, the user can get\npermission by providing the credentials to the FTP server or can use anonymous\nFTP.\nWhen an FTP connection is established, there are two types of communication\nchannels are also established and they are known as command channel and data\nchannel. The command channel is used to transfer the commands and responses"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 19, "text": "channel. The command channel is used to transfer the commands and responses\nfrom client to server and server to client. FTP uses the same approach as TELNET\nor SMTP to communicate across the control connection. It uses the NVT ASCII\ncharacter set for communication. It uses port number 21. Whereas the data channel\nis used to actually transfer the data between client and server. It uses port number\n20.\nThe FTP client using the URL gives the FTP command along with the FTP server\naddress. As soon as the server and the client get connected to the network, the user\nlogins using User ID and password. If the user is not registered with the server,\nthen also he/she can access the files by using the anonymous login where the\npassword is the client’s email address. The server verifies the user login and allows\nthe client to access the files. The client transfers the desired files and exits the\nconnection. The figure below shows the working of FTP.\nDetail Steps of FTP"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 20, "text": "connection. The figure below shows the working of FTP.\nDetail Steps of FTP\n● FTP client contacts FTP server at port 21 specifying TCP as transport\nprotocol.\n● Client obtain authorization over control connection.\n● Client browse remote directory by sending commands over control\nconnection.\n● When server receives a command for a file transfer, the server open a\nTCP data connection to client.\n● after transferring one file, server closes connection.\n● server opens a second TCP data connection to transfer another file.\n● FTP server maintains state i.e. current directory, earlier authentication.\nTransmission Mode\nFTP transfer files using any of the following modes:\n● Stream Mode: It is the default mode. In stream mode, the data is\ntransferred from FTP to TCP in stream bytes. Here TCP is the cause for\nfragmenting data into small segments. The connection is automatically\nclosed if the transforming data is in the stream bytes. Otherwise, the\nsender will close the connection."}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 21, "text": "closed if the transforming data is in the stream bytes. Otherwise, the\nsender will close the connection.\n● Block Mode: In block mode, the data is transferred from FTP to TCP in\nthe form of blocks, and each block followed by a 3-byte header. The first\nbyte of the block contains the information about the block so it is known\nas the description block and the other two bytes contain the size of the\nblock.\n● Compressed Mode: This mode is used to transfer big files. As we know\nthat, due to the size limit we can not transfer big files on the internet, so\nthe compressed mode is used to decrease the size of the file into small\nand send it on the internet.\nFTP Commands\nSr. no. Command Meaning\n1. cd Changes the working directory on the remote host\n2. close Closes the FTP connection\n3. quit Quits FTP\n4. pwd displays the current working Directory on the remote host\n5. dir or ls Provides a Directory Listing of the current working directory\n6. help Displays a list of all client FTP commands"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 22, "text": "5. dir or ls Provides a Directory Listing of the current working directory\n6. help Displays a list of all client FTP commands\n7. remotehelp Displays a list of all server FTP commands\n8. type Allows the user to specify the file type\n9. struct specifies the files structure\nApplications of FTP\nThe following are the applications of FTP:\n● FTP connection is used by different big business organizations for\ntransferring files in between them, like sharing files to other employees\nworking at different locations or different branches of the organization.\n● FTP connection is used by IT companies to provide backup files at\ndisaster recovery sites.\n● Financial services use FTP connections to securely transfer financial\ndocuments to the respective company, organization, or government.\n● Employees use FTP connections to share any data with their co-workers.\nAdvantages of FTP\n● Multiple transfers: FTP helps to transfer multiple large files in between\nthe systems."}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 23, "text": "Advantages of FTP\n● Multiple transfers: FTP helps to transfer multiple large files in between\nthe systems.\n● Efficiency: FTP helps to organize files in an efficient manner and\ntransfer them efficiently over the network.\n● Security: FTP provides access to any user only through user ID and\npassword. Moreover, the server can create multiple levels of access.\n● Continuous transfer: If the transfer of the file is interrupted by any\nmeans, then the user can resume the file transfer whenever the connection\nis established.\n● Simple: FTP is very simple to implement and use, thus it is a widely\nused connection.\n● Speed: It is the fastest way to transfer files from one computer to\nanother.\nDisadvantages of FTP\n● Less security: FTP does not provide an encryption facility when\ntransferring files. Moreover, the username and passwords are in plain text\nand not a combination of symbols, digits, and alphabets, which makes it\neasier to be attacked by hackers."}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 24, "text": "and not a combination of symbols, digits, and alphabets, which makes it\neasier to be attacked by hackers.\n● Old technology: FTP is one of the oldest protocols and thus it uses\nmultiple TCP/IP connections to transfer files. These connections are\nhindered by firewalls.\n● Virus: The FTP connection is difficult to be scanned for viruses, which\nagain increases the risk of vulnerability.\n● Limited: The FTP provides very limited user permission and mobile\ndevice access.\n● Memory and programming: FTP requires more memory and\nprogramming efforts, as it is very difficult to find errors without the\ncommands.\nElectronic Mail\nElectronic mail, commonly known as email, is a method of exchanging\nmessages over the internet. Here are the basics of email:\n1. An email address: This is a unique identifier for each user, typically in\nthe format of name@domain.com.\n2. An email client: This is a software program used to send, receive and\nmanage emails, such as Gmail, Outlook, or Apple Mail."}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 25, "text": "2. An email client: This is a software program used to send, receive and\nmanage emails, such as Gmail, Outlook, or Apple Mail.\n3. An email server: This is a computer system responsible for storing and\nforwarding emails to their intended recipients.\nTo send an email:\n1. Compose a new message in your email client.\n2. Enter the recipient’s email address in the “To” field.\n3. Add a subject line to summarize the content of the message.\n4. Write the body of the message.\n5. Attach any relevant files if needed.\n6. Click “Send” to deliver the message to the recipient’s email server.\n7. Emails can also include features such as cc (carbon copy) and bcc (blind\ncarbon copy) to send copies of the message to multiple recipients, and\nreply, reply all, and forward options to manage the conversation.\nElectronic Mail (e-mail) is one of most widely used services of Internet. This\nservice allows an Internet user to send a message in formatted manner (mail) to"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 26, "text": "service allows an Internet user to send a message in formatted manner (mail) to\nthe other Internet user in any part of world. Message in mail not only contain text,\nbut it also contains images, audio and videos data. The person who is sending mail\nis called sender and person who receives mail is called recipient. It is just like\npostal mail service. Components of E-Mail System : The basic components of an\nemail system are : User Agent (UA), Message Transfer Agent (MTA), Mail Box,\nand Spool file. These are explained as following below.\n1. User Agent (UA) : The UA is normally a program which is used to send\nand receive mail. Sometimes, it is called as mail reader. It accepts variety\nof commands for composing, receiving and replying to messages as well\nas for manipulation of the mailboxes.\n2. Message Transfer Agent (MTA) : MTA is actually responsible for\ntransfer of mail from one system to another. To send a mail, a system"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 27, "text": "2. Message Transfer Agent (MTA) : MTA is actually responsible for\ntransfer of mail from one system to another. To send a mail, a system\nmust have client MTA and system MTA. It transfer mail to mailboxes of\nrecipients if they are connected in the same machine. It delivers mail to\npeer MTA if destination mailbox is in another machine. The delivery\nfrom one MTA to another MTA is done by Simple Mail Transfer\nProtocol.\n1. Mailbox : It is a file on local hard drive to collect mails. Delivered mails\nare present in this file. The user can read it delete it according to his/her\nrequirement. To use e-mail system each user must have a mailbox .\nAccess to mailbox is only to owner of mailbox.\n2. Spool file : This file contains mails that are to be sent. User agent\nappends outgoing mails in this file using SMTP. MTA extracts pending\nmail from spool file for their delivery. E-mail allows one name, an alias,\nto represent several different e-mail addresses. It is known as mailing"}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 28, "text": "mail from spool file for their delivery. E-mail allows one name, an alias,\nto represent several different e-mail addresses. It is known as mailing\nlist, Whenever user have to sent a message, system checks recipient’s\nname against alias database. If mailing list is present for defined alias,\nseparate messages, one for each entry in the list, must be prepared and\nhanded to MTA. If for defined alias, there is no such mailing list is\npresent, name itself becomes naming address and a single message is\ndelivered to mail transfer entity.\nServices provided by E-mail system :\n● Composition – The composition refer to process that creates messages\nand answers. For composition any kind of text editor can be used.\n● Transfer – Transfer means sending procedure of mail i.e. from the\nsender to recipient.\n● Reporting – Reporting refers to confirmation for delivery of mail. It help\nuser to check whether their mail is delivered, lost or rejected."}, {"pdf": "5.2 Application layer (1).pdf", "chunk_index": 29, "text": "● Reporting – Reporting refers to confirmation for delivery of mail. It help\nuser to check whether their mail is delivered, lost or rejected.\n● Displaying – It refers to present mail in form that is understand by the\nuser.\n● Disposition – This step concern with recipient that what will recipient do\nafter receiving mail i.e save mail, delete before reading or delete after\nreading."}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 0, "text": "Modue_5 :Network Design Concepts\nIntroduction to VLAN, VPN.\nVirtual LAN (VLAN)\nVirtual LAN (VLAN) is a concept in which we can divide the devices logically on layer 2 (data\nlink layer). Generally, layer 3 devices divide the broadcast domain but the broadcast domain can\nbe divided by switches using the concept of VLAN.\nA broadcast domain is a network segment in which if a device broadcast a packet then all the\ndevices in the same broadcast domain will receive it. The devices in the same broadcast domain\nwill receive all the broadcast packets but it is limited to switches only as routers don’t forward\nout the broadcast packet. To forward out the packets to different VLAN (from one VLAN to\nanother) or broadcast domains, inter Vlan routing is needed. Through VLAN, different small-\nsize sub-networks are created which are comparatively easy to handle.\nLAN ranges:\n● VLAN 0, 4095: These are reserved VLAN which cannot be seen or used."}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 1, "text": "LAN ranges:\n● VLAN 0, 4095: These are reserved VLAN which cannot be seen or used.\n● VLAN 1: It is the default VLAN of switches. By default, all switch ports are in\nVLAN. This VLAN can’t be deleted or edit but can be used.\n● VLAN 2-1001: This is a normal VLAN range. We can create, edit and delete these\nVLAN.\n● VLAN 1002-1005: These are CISCO defaults for fddi and token rings. These VLAN\ncan’t be deleted.\n● Vlan 1006-4094: This is the extended range of Vlan.\nVLANs offer several features and benefits, including:\n● Improved network security: VLANs can be used to separate network traffic and\nlimit access to specific network resources. This improves security by preventing\nunauthorized access to sensitive data and network resources.\n● Better network performance: By segregating network traffic into smaller logical\nnetworks, VLANs can reduce the amount of broadcast traffic and improve network\nperformance.\n● Simplified network management: VLANs allow network administrators to group"}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 2, "text": "performance.\n● Simplified network management: VLANs allow network administrators to group\ndevices together logically, rather than physically, which can simplify network\nmanagement tasks such as configuration, troubleshooting, and maintenance.\n● Flexibility: VLANs can be configured dynamically, allowing network administrators\nto quickly and easily adjust network configurations as needed.\n● Cost savings: VLANs can help reduce hardware costs by allowing multiple virtual\nnetworks to share a single physical network infrastructure.\n● Scalability: VLANs can be used to segment a network into smaller, more\nmanageable groups as the network grows in size and complexity.\nSome of the key features of VLANs include:\n● VLAN tagging: VLAN tagging is a way to identify and distinguish VLAN traffic\nfrom other network traffic. This is typically done by adding a VLAN tag to the\nEthernet frame header.\n● VLAN membership: VLAN membership determines which devices are assigned to"}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 3, "text": "Ethernet frame header.\n● VLAN membership: VLAN membership determines which devices are assigned to\nwhich VLANs. Devices can be assigned to VLANs based on port, MAC address, or\nother criteria.\n● VLAN trunking: VLAN trunking allows multiple VLANs to be carried over a single\nphysical link. This is typically done using a protocol such as IEEE 802.1Q.\n● VLAN management: VLAN management involves configuring and managing\nVLANs, including assigning devices to VLANs, configuring VLAN tags, and\nconfiguring VLAN trunking.\nTypes of connections in VLAN –\nThere are three ways to connect devices on a VLAN, the type of connections are based on the\nconnected devices i.e. whether they are VLAN-aware(A device that understands VLAN formats\nand VLAN membership) or VLAN-unaware(A device that doesn’t understand VLAN format and\nVLAN membership).\n1. Trunk Link –\nAll connected devices to a trunk link must be VLAN-aware. All frames on this should\nhave a special header attached to it called tagged frames."}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 4, "text": "All connected devices to a trunk link must be VLAN-aware. All frames on this should\nhave a special header attached to it called tagged frames.\n2. Access link –\nIt connects VLAN-unaware devices to a VLAN-aware bridge. All frames on the\naccess link must be untagged.\n3. Hybrid link –\nIt is a combination of the Trunk link and Access link. Here both VLAN-unaware and\nVLAN-aware devices are attached and it can have both tagged and untagged frames.\nAdvantages –\n● Performance –\nThe network traffic is full of broadcast and multicast. VLAN reduces the need to send\nsuch traffic to unnecessary destinations. e.g.-If the traffic is intended for 2 users but\nas 10 devices are present in the same broadcast domain, therefore, all will receive the\ntraffic i.e. wastage of bandwidth but if we make VLANs, then the broadcast or\nmulticast packet will go to the intended users only.\n● Formation of virtual groups –\nAs there are different departments in every organization namely sales, finance etc.,"}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 5, "text": "● Formation of virtual groups –\nAs there are different departments in every organization namely sales, finance etc.,\nVLANs can be very useful in order to group the devices logically according to their\ndepartments.\n● Security –\nIn the same network, sensitive data can be broadcast which can be accessed by the\noutsider but by creating VLAN, we can control broadcast domains, set up firewalls,\nrestrict access. Also, VLANs can be used to inform the network manager of an\nintrusion. Hence, VLANs greatly enhance network security.\n● Flexibility –\nVLAN provide flexibility to add, remove the number of host we want.\n● Cost reduction –\nVLANs can be used to create broadcast domains which eliminate the need for\nexpensive routers.\nBy using Vlan, the number of small size broadcast domain can be increased which are\neasy to handle as compared to a bigger broadcast domain.\nDisadvantages of VLAN\n1. Complexity: VLANs can be complex to configure and manage, particularly in large"}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 6, "text": "Disadvantages of VLAN\n1. Complexity: VLANs can be complex to configure and manage, particularly in large\nor dynamic cloud computing environments.\n2. Limited scalability: VLANs are limited by the number of available VLAN IDs,\nwhich can be a constraint in larger cloud computing environments.\n3. Limited security: VLANs do not provide complete security and can be compromised\nby malicious actors who are able to gain access to the network.\n4. Limited interoperability: VLANs may not be fully compatible with all types of\nnetwork devices and protocols, which can limit their usefulness in cloud computing\nenvironments.\n5. Limited mobility: VLANs may not support the movement of devices or users\nbetween different network segments, which can limit their usefulness in mobile or\nremote cloud computing environments.\n6. Cost: Implementing and maintaining VLANs can be costly, especially if specialized\nhardware or software is required."}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 7, "text": "6. Cost: Implementing and maintaining VLANs can be costly, especially if specialized\nhardware or software is required.\n7. Limited visibility: VLANs can make it more difficult to monitor and troubleshoot\nnetwork issues, as traffic is isolated in different segments.\nReal-Time Applications of VLAN\nVirtual LANs (VLANs) are widely used in cloud computing environments to improve network\nperformance and security. Here are a few examples of real-time applications of VLANs:\n1. Voice over IP (VoIP) : VLANs can be used to isolate voice traffic from data traffic,\nwhich improves the quality of VoIP calls and reduces the risk of network congestion.\n2. Video Conferencing : VLANs can be used to prioritize video traffic and ensure that\nit receives the bandwidth and resources it needs for high-quality video conferencing.\n3. Remote Access : VLANs can be used to provide secure remote access to cloud-based\napplications and resources, by isolating remote users from the rest of the network."}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 8, "text": "applications and resources, by isolating remote users from the rest of the network.\n4. Cloud Backup and Recovery : VLANs can be used to isolate backup and recovery\ntraffic, which reduces the risk of network congestion and improves the performance\nof backup and recovery operations.\n5. Gaming : VLANs can be used to prioritize gaming traffic, which ensures that gamers\nreceive the bandwidth and resources they need for a smooth gaming experience.\n6. IoT : VLANs can be used to isolate Internet of Things (IoT) devices from the rest of\nthe network, which improves security and reduces the risk of network congestion.\nVPN in Computer Networks\nWhat is VPN in Computer Networks?\nA VPN (Virtual Private Network) is a powerful tool that enhances online privacy, protects\nsensitive data, and enables secure access to the internet. In today’s interconnected world, online\nprivacy and data security are more important than ever. One of the best ways to protect"}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 9, "text": "privacy and data security are more important than ever. One of the best ways to protect\nyourself and enhance your internet experience is by using a VPN (Virtual Private Network).\nWhether you’re looking to secure your data, bypass geo-restrictions, or simply want to\nmaintain your anonymity online, a VPN is an invaluable tool.\nVPN Connection Diagram\nA VPN connection is shown in the figure below\nIn this figure, Routers R1 and R2 use VPN technology to guarantee privacy for the organization.\nWhat Is a VPN?\nA VPN (Virtual Private Network) is a technology that creates a secure, encrypted connection\nbetween your device and the internet. It essentially acts as a private tunnel for your internet\ntraffic, preventing hackers, ISPs, and even governments from monitoring your activities. When\nusing a VPN, your IP address is masked, and your online actions are routed through a remote\nserver, making it harder to track your online activity.\nKey Benefits of Using a VPN:"}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 10, "text": "server, making it harder to track your online activity.\nKey Benefits of Using a VPN:\n1. Privacy Protection: A VPN hides your IP address, ensuring that your browsing habits\nand activities remain private.\n2. Security on Public Networks: Public Wi-Fi networks are often insecure, but a VPN\nencrypts your connection, making it safer to browse the internet on networks like those in\ncafes or airports.\n3. Bypass Geo-restrictions: A VPN allows you to access content that may be blocked in\ncertain regions (such as streaming platforms, social media sites, etc.).\n4. Prevent Data Throttling: Some ISPs throttle your connection speed when you stream or\nplay games. A VPN can bypass this, allowing for faster internet speeds.\n5. Accessing Remote Work Resources: A VPN enables secure access to private networks,\nmaking it ideal for businesses and remote workers.\nHow Does a VPN Work?\nA VPN works by creating an encrypted tunnel between your device and a remote server. Here’s\nthe process simplified:"}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 11, "text": "How Does a VPN Work?\nA VPN works by creating an encrypted tunnel between your device and a remote server. Here’s\nthe process simplified:\n1. Connection Establishment: When you activate a VPN on your device, it connects to a\nserver operated by the VPN provider.\n2. Encryption: The VPN encrypts your data (information, files, web traffic) so that it’s\nunreadable to anyone trying to intercept it, whether it’s a hacker on the same Wi-Fi\nnetwork or an entity trying to monitor your browsing.\n3. Traffic Redirection: Your device’s internet traffic is routed through the VPN server,\nwhich can be located in any country. This makes it appear as though you’re browsing\nfrom the server’s location, masking your actual IP address.\n4. Decryption: Once your data reaches the VPN server, it is decrypted and sent to the\ndestination (such as a website, app, or service). Any response from the server is then sent\nback to you through the encrypted tunnel."}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 12, "text": "destination (such as a website, app, or service). Any response from the server is then sent\nback to you through the encrypted tunnel.\nThis end-to-end encryption ensures that your sensitive data stays private and your location\nremains anonymous.\nTypes of VPN\nVPNs come in various types, each catering to different needs, from individual privacy to\nenterprise-level solutions. Below are the main types of VPNs:\n1. Remote Access VPN\nA Remote Access VPN allows individual users to connect to a network remotely, such as\naccessing work files from home. It’s ideal for people who need secure access to a private\nnetwork from anywhere.\n2. Site-to-Site VPN\nA Site-to-Site VPN is used to connect two networks, often used by businesses with multiple\noffice locations. It securely links two private networks over the internet, enabling employees to\naccess resources from both locations.\n3. Mobile VPN\nA Mobile VPN is designed for mobile devices like smartphones and tablets. It ensures stable"}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 13, "text": "access resources from both locations.\n3. Mobile VPN\nA Mobile VPN is designed for mobile devices like smartphones and tablets. It ensures stable\nconnections even when switching between different networks (such as from Wi-Fi to mobile\ndata) and is used in industries like healthcare and logistics where users need continuous access\nwhile moving.\n4. MPLS VPN (Multiprotocol Label Switching)\nAn MPLS VPN is used mainly by large businesses and enterprise networks. It routes data\nbetween different locations through an efficient network that prioritizes data traffic. It’s often\nmore complex and provides more scalability compared to traditional VPNs.\n5. PPTP VPN (Point-to-Point Tunneling Protocol)\nPPTP is one of the oldest VPN protocols and is known for being fast but less secure compared to\nothers. It is rarely used in modern systems due to its vulnerabilities, but it’s still available on\nsome legacy systems.\n6. L2TP/IPsec VPN (Layer 2 Tunneling Protocol with IPsec)"}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 14, "text": "some legacy systems.\n6. L2TP/IPsec VPN (Layer 2 Tunneling Protocol with IPsec)\nL2TP combined with IPsec offers more security than PPTP. It uses encryption to secure data,\nmaking it a popular option for users who need a reliable, moderately secure connection.\n7. OpenVPN\nOpenVPN is a highly secure, open-source VPN protocol known for its flexibility and strength in\nencryption. It’s often used for custom VPN setups and is highly configurable, making it a\npopular choice for advanced users.\n8. IKEv2/IPsec VPN (Internet Key Exchange version 2)\nIKEv2 is a fast, stable, and secure VPN protocol that works well on mobile devices. It\nautomatically reconnects when the device switches between networks, providing continuous\nservice without interruptions.\nDifferences Between VPN And VLAN\nParameter of\nVLAN VPN\nComparison\nVirtual Local Area Network\nFull Form Virtual Private Network (VPN)\n(VLAN)\nType of VLAN:\nType of VPN:\n1. Port-based VLAN\nTypes 1. Remote Access VPN\n2. Protocol-based VLAN"}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 15, "text": "Full Form Virtual Private Network (VPN)\n(VLAN)\nType of VLAN:\nType of VPN:\n1. Port-based VLAN\nTypes 1. Remote Access VPN\n2. Protocol-based VLAN\n2. Site-to-Site VPN\n3. MAC-based VLAN\nVLANs are the kind of VPNs are the technology a\nKind of service\nsubnetworks service\nVLANs use virtual LANs to VPN uses encryption to create\nTake help of\nsegment traffic a virtual private network\nHelp in connecting multiple\nHelp in connecting\nPurpose devices that are separated by\nauthorization personals\ndistance\nhierarchical\nVLAN is a subset of the VPN VPN is a superset of VLAN\nstructure\nuse to consolidate(or strong)\nDefinition devices that are separated, into a use to transmit secure data\nsingle Broadcast Domain\nVLAN does not use any kind of VPN uses a virtual tunnel for\nTunnel/channel\ntunnel secure connection\nSecurity less secure as compared to VPN more secure\nPrice VLANs are cheap VPNs are expensive\nVLAN is less efficient as\nEfficiency VPN increases the efficiency\ncompared to the VPN"}, {"pdf": "Chapter_6.1 (1).pdf", "chunk_index": 16, "text": "Price VLANs are cheap VPNs are expensive\nVLAN is less efficient as\nEfficiency VPN increases the efficiency\ncompared to the VPN\nSimilarities Between VPN And VLAN\nDespite being so many differences between VLAN and VPN, there are multiple similarities\nbetween them,\n● In terms of network scalability both VPN and VLAN allow multiple institutes\nand corporates to maintain their webbing more effectively.\n● VPN and VLAN both can be used to enhance privacy or security by encrypting\nthe network traffic.\n● VPN and VLAN can be used to improve network security.\n● As far as route traffic is concerned both VPN and VLAN use IP addresses.\n● Within the physical network layer VPN and VLAN both are used to create\nindependent virtual networks.\n● Both are used in saving the cost of the different institutes and corporate by\nreducing the need for physical network components"}]